NordicPlayground/nRF51-multi-role-conn-observer-advertiser/btle_hci/advertiser/ts_controller.c
/***********************************************************************************
Copyright (c) Nordic Semiconductor ASA
All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

	1. Redistributions of source code must retain the above copyright notice, this
	list of conditions and the following disclaimer.

	2. Redistributions in binary form must reproduce the above copyright notice, this
	list of conditions and the following disclaimer in the documentation and/or
	other materials provided with the distribution.

	3. Neither the name of Nordic Semiconductor ASA nor the names of other
	contributors to this software may be used to endorse or promote products
	derived from this software without specific prior written permission.

	4. This software must only be used in a processor manufactured by Nordic
	Semiconductor ASA, or in a processor manufactured by a third party that
	is used in combination with a processor manufactured by Nordic Semiconductor.


THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
************************************************************************************/

#include "ts_controller.h"

#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include "ts_rng.h"
#include "nrf_gpio.h"
#include "boards.h"
#include "nrf_assert.h"
#include "app_error.h"	

#include "app_uart.h"

#include "btle.h"
#include "ts_peripheral.h"
#include "nrf_advertiser.h"
#include "nrf_report_disp.h"
#include "ts_whitelist.h"

	
	
/*****************************************************************************
* Local Definitions
*****************************************************************************/


/* Disable this flag to disable listening for scan requests, and jump straight to 
* next advertisement 
*/
#define TS_SEND_SCAN_RSP (1)
#define softdevice (1)
#define nosoftdevice (0)

#define BLE_ADV_INTERVAL_100MS 0x00A0  //160=100/0.625
#define BLE_ADV_INTERVAL_150MS 0x00F0  //240=150/0.625


/* Quick macro to scale the interval to the timeslot scale */
#define ADV_INTERVAL_TRANSLATE(interval) (625 * (interval)) // in us

/* short macro to check whether the given event is triggered */
#define RADIO_EVENT(x) (NRF_RADIO->x != 0)

/*****************************************************************************
* Static Globals
*****************************************************************************/
void sm_enter_req(void);


/* Buffer for advertisement data */
static uint8_t ble_adv_data[BLE_ADDR_OFFSET + BLE_ADDR_LEN + BLE_PAYLOAD_MAXLEN];
static uint8_t ble_scan_rsp_data[BLE_ADDR_LEN + BLE_PAYLOAD_MAXLEN];


//static uint8_t ble_adv_data[] =
//{
//	0x00,                               // BLE Header (PDU_TYPE: ADV_IND, TXadd: 0 (public address), RFU: 0)
//	0x1E,                               // Length of payload: 30
//	0x00,                               // Padding bits for S1 (REF: the  nRF51 reference manual 16.1.2)
//	0x00, 0xCE, 0xAB, 0x48, 0xDE, 0xAC, // AdvAddress LSByte first, AC-DE-48-AB-CE-00 
//  /* Flags: */ // payload 24
//  0x02,                   /* length */
//  0x01,                   /* type (flags) */
//  0x06,                   /* AD Flags*/
//  /* Appearance: */
//  0x03,                   /* length */
//  0x19,                   /* type (Appearance) */
//  0x00, 0x00,             /* Generic unspecified */
//  /* Role: */
//  0x02,                   /* length */
//  0x1c,                   /* type (LE role) */
//  0x00,                   /* Only peripheral role supported */
//  /* Complete local name: */
//  0x0D,                   /* length */
//  0x09,                   /* type (complete local name) */
//  'A', 'n', 'o', 'm', 'a', 'd', 'a', 'r', 's', 'h', 'i',' ',
//};


//static uint8_t ble_scan_rsp_data[] =
//{
//	0x04,                               // BLE Header (PDU_TYPE: SCAN_RSP, TXadd: 0 (public address), RFU: 0)
//	0x1E,                               // Length of payload: 30
//	0x00,                               // Padding bits for S1 (REF: the  nRF51 reference manual 16.1.2)
//	0x00, 0xCE, 0xAB, 0x48, 0xDE, 0xAC, // AdvAddress LSByte first, AC-DE-48-AB-CE-00 
//  /* Flags: */ //payload 24 byte
//  0x02,                   /* length */
//  0x01,                   /* type (flags) */
//  0x06,                   /* AD Flags*/
//  /* Appearance: */
//  0x03,                   /* length */
//  0x19,                   /* type (Appearance) */
//  0x00, 0x00,             /* Generic unspecified */
//  /* Role: */
//  0x02,                   /* length */
//  0x1c,                   /* type (LE role) */
//  0x00,                   /* Only peripheral role supported */
//  /* Complete local name: */
//  0x0D,                   /* length */
//  0x09,                   /* type (complete local name) */
//  'A', 'a', 'a', 'a', 'a', 'd', 'a', 'r', 's', 'h', 'i',' ',
//};

static uint8_t ble_linklayer_data[] =
{
	0x11,                               // LL Header (LLID :01 and length : 0  RFU: 0  MD :1)
	0x00,                               // Length of payload: 00
	0x00,                               // Padding bits for S1 (REF: the  nRF51 reference manual 16.1.2)
};

static  uint8_t ble_acknow_data[] =
														{
															0x09,                               // LL Header (LLID :01 and length : 0  RFU: 0  MD :1)
															0x00,                               // Length of payload: 00
															0x00                               // Padding bits for S1 (REF: the  nRF51 reference manual 16.1.2)
														};
														
static uint8_t ble_terminate_data[] =
												{
													0x00,                               // LL Header (LLID :11 and length : 0  RFU: 0  MD :0) acknowledge bit set 
													0x02,                               // Length of payload: 02
													0x00,                               // Padding bits for S1 (REF: the  nRF51 reference manual 16.1.2)
													0x02,                               // opcode of termination 
													0x00                                // space for error code 
													
