NordicPlayground/nRF51-multi-role-conn-observer-advertiser/btle_hci/advertiser/ts_controller.c
												};
												
 static  uint8_t ble_version_data[] =
														{
															0x03,                               // LL Header (LLID :01 and length : 0  RFU: 0  MD :1)
															0x06,                               // Length of payload: 00
															0x00,                               // Padding bits for S1 (REF: the  nRF51 reference manual 16.1.2)
															0x0C,                               // opcode of LL_VERSION_END
															0x06,                               //  LLVersNr
															0x4C,                               //  CompId
															0x00,                               //  ComId
															0x01,                               // SubVersNr
															0x00                                // SubVersNr
														}; 											

static  uint8_t ble_feature_rsp_data[] =
														{
															0x03,                               // LL Header (LLID :01 and length : 0  RFU: 0  MD :1)
															0x09,                               // Length of payload: 00
															0x00,                               // Padding bits for S1 (REF: the  nRF51 reference manual 16.1.2)
															0x09,                               // opcode of LL_VERSION_END
															0x1F,                               //  LLVersNr
															0x00,                               //  CompId
															0x00,                               //  ComId
															0x00,                               // SubVersNr
															0x00,                                // SubVersNr
															0x00,
															0x00,
															0x00
														}; 														
												
//#if TS_SEND_SCAN_RSP
/* Buffer for scan response data, only available in scan request/response mode,
* see define at top */


/* Buffer for any message receiving, only available in scan request/response mode,
* see define at top */
static uint8_t ble_rx_buf[BLE_ADDR_LEN + BLE_PAYLOAD_MAXLEN]; //BLE_PAYLOAD_MAXLEN =31 byte 0248 bits BLE_ADDR_LEN = 6 

/* Packet counter */
static uint16_t packet_count_valid;

/* Faulty packets counter */
static uint16_t packet_count_invalid;
//#endif

/* Store the radio channel */
static uint8_t channel;

/* running flag for advertiser. Decision point: end of timeslot (adv event) */
static bool sm_adv_run;

/* Channel map for advertisement */
static btle_dd_channel_map_t channel_map;
	
/* min advertisement interval */
static btle_adv_interval_t adv_int_min = BLE_ADV_INTERVAL_100MS;

/* max advertisement interval */
static btle_adv_interval_t adv_int_max = BLE_ADV_INTERVAL_150MS;

/* statemachine state */
static ts_state_t sm_state;

/* advertisement param->type to spec type map */
static const uint8_t ble_adv_type_raw[] = {0, 1, 6, 2};

/* Pool of 255 (the range of the RNG-peripheral) psedorandomly generated values */
//static uint8_t rng_pool[100];

/* A pointer into our pool. Will wrap around upon overflow */

static uint8_t pool_index = 0;
static const uint8_t data_freq_bins[] = {4, 6,8,10,12,14,16,18,20,22,24,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60,62,64,66,68,70,72,74,76,78};

//static uint8_t InitA[BLE_ADDR_LEN];
static uint8_t AdvA[BLE_ADDR_LEN];
static uint8_t AcessA[4];
static uint8_t CRCinit[3];
static char WinSize[1];
static uint8_t WinOffset[2];
static uint8_t ConnInterval[2];
static uint8_t ChMapp[5];
static char Hop[1];

static uint8_t missed_counter ;	
	
	
static uint32_t x1,a;
static uint16_t connection_event_counter ;
	
static uint32_t wsize ;
static uint32_t woffset ;
static uint32_t cointerval ;
static uint8_t num_used_channel=0;
static uint8_t used_channel_map[40];
static uint8_t chmapp [40]; 
static uint8_t hopping;

static uint32_t new_cointerval; 
static uint8_t new_ConnInterval[2];
static uint8_t new_WinOffset[2];
static uint32_t new_woffset ;

static uint8_t Instant[2] ;
static uint16_t instant ;

static uint8_t Channel_Map_Instant[2];
static uint16_t channel_map_instant ;
static uint8_t New_ChMapp[5];
static uint8_t new_num_used_channel=0;
static uint8_t new_used_channel_map[40];
static uint8_t new_chmapp [40]; 

static uint8_t next= 0 ;
static uint8_t flag= 0 ;

static uint8_t last_unmapped_channel =0 ;
static uint8_t unmapped_channel  ;
static uint8_t data_channel  ;


static void sm_exit_scan_req_rsp(void);
static void sm_enter_scan_req_rsp(void);
static void sm_enter_wait_for_idle(bool req_rx_accepted);
static bool sm_exit_wait_for_idle(void);

static void sm_enter_conn_req_rsp(void);

static void set_channel_connection (void);
void sm_enter_conn_req(void);
void reconfigure_radio_for_connection (void);
void start_master_to_slave_receive (void);

/*****************************************************************************
* Globals
*****************************************************************************/

/* return param in signal handler */
nrf_radio_signal_callback_return_param_t g_signal_callback_return_param;


/* timeslot request EARLIEST. Used to send the first timeslot request */
static nrf_radio_request_t g_timeslot_req_earliest = 
			{NRF_RADIO_REQ_TYPE_EARLIEST, 
			.params.earliest = {
						HFCLK, 
						NRF_RADIO_PRIORITY_NORMAL, 
						50000, 		//4300 /**< The radio timeslot length (in the range 100 to 100,000] microseconds). */
						10000}    /**< Longest acceptable delay until the start of the requested timeslot*/
			};

/* timeslot request NORMAL. Used to request a periodic timeslot, i.e. advertisement events */
static nrf_radio_request_t g_timeslot_req_normal =
			{NRF_RADIO_REQ_TYPE_NORMAL, 
			.params.normal = {
						HFCLK, 
						NRF_RADIO_PRIORITY_HIGH, 
						TIMESLOT_INTERVAL_100MS, //Distance from the start of the previous radio timeslot		
						TIMESLOT_LENGTH} /**< 10000 The radio timeslot length (in the range [100..100,000] microseconds). */
			};


			
/*****************************************************************************
* Static Functions
*****************************************************************************/
			

/**
* Get next channel to use. Affected by the tsa adv channels.
*/		
			
/**********************************************************************/			
#if softdevice

/**
* Send initial time slot request to API. 
*/
static __INLINE void timeslot_req_initial(void)
{	
	DEBUG_PIN_POKE(7);
	uint8_t error_code = sd_radio_request(&g_timeslot_req_earliest); 	// send to sd: 
	APP_ERROR_CHECK(error_code);
}


/**
* Request a new timeslot for the next advertisement event
* If the advertiser has been told to stop, the function will not 
* schedule any more, but just end the timeslot.
*/
static __INLINE void next_timeslot_schedule(void)
{
	if (sm_adv_run)
	{ 
		
		g_timeslot_req_normal.params.normal.distance_us =adv_int_min*1000;// 120000;//ADV_INTERVAL_TRANSLATE(adv_int_min) 
																										//+ 1000 * ((rng_pool[pool_index++]) % (ADV_INTERVAL_TRANSLATE(adv_int_max - adv_int_min)));
		g_timeslot_req_normal.params.normal.length_us = 55000 ;
		g_signal_callback_return_param.params.request.p_next = &g_timeslot_req_normal;
		g_signal_callback_return_param.callback_action = NRF_RADIO_SIGNAL_CALLBACK_ACTION_REQUEST_AND_END;

