NordicPlayground/nRF51-multi-role-conn-observer-advertiser/btle_hci/advertiser/ts_controller.c
	}
	else
	{
		g_signal_callback_return_param.callback_action = NRF_RADIO_SIGNAL_CALLBACK_ACTION_END;
	}
}

//this timeslot request will be called when TIMER0 will be timed out because of no reception of any master to slave empty PDU data packet in connection state

static __INLINE void next_timeslot_schedule_connection(void)
{
	if (sm_adv_run)
	{ 
	
		a = (cointerval-200+ woffset + 1000 ) ;
	
		g_timeslot_req_normal.params.normal.distance_us = a ;
		g_timeslot_req_normal.params.normal.length_us = 12000 ;
		g_signal_callback_return_param.params.request.p_next = &g_timeslot_req_normal;
		g_signal_callback_return_param.callback_action = NRF_RADIO_SIGNAL_CALLBACK_ACTION_REQUEST_AND_END;
	

	}
	else
	{
		g_signal_callback_return_param.callback_action = NRF_RADIO_SIGNAL_CALLBACK_ACTION_END;
	}
}


static __INLINE void next_timeslot_schedule_connection_timer(void)
{
	if (sm_adv_run)
	{ 
		
		a = (cointerval-200 ) ;
	
		g_timeslot_req_normal.params.normal.distance_us = a ;
		g_timeslot_req_normal.params.normal.length_us = 12000 ;
		g_signal_callback_return_param.params.request.p_next = &g_timeslot_req_normal;
		g_signal_callback_return_param.callback_action = NRF_RADIO_SIGNAL_CALLBACK_ACTION_REQUEST_AND_END;
		

	}
	else
	{
		g_signal_callback_return_param.callback_action = NRF_RADIO_SIGNAL_CALLBACK_ACTION_END;
	}
}

//this timeslot request will be called after the successful send of empty PDU data from slave to master in connection state 
static __INLINE void next_timeslot_schedule_connection_2(void)
{
	if (sm_adv_run)
	{ 
		
		a = (cointerval-300+x1 ) ;
		g_timeslot_req_normal.params.normal.distance_us = a ;
		g_timeslot_req_normal.params.normal.length_us = 10000 ;
		g_signal_callback_return_param.params.request.p_next = &g_timeslot_req_normal;
		g_signal_callback_return_param.callback_action = NRF_RADIO_SIGNAL_CALLBACK_ACTION_REQUEST_AND_END;
		
	}
	else
	{
		g_signal_callback_return_param.callback_action = NRF_RADIO_SIGNAL_CALLBACK_ACTION_END;
	}
}



static __INLINE void next_timeslot_schedule_advertisement(void)
{
	if (sm_adv_run)
	{ 
		
		g_timeslot_req_normal.params.normal.distance_us = 20000 ;
		g_timeslot_req_normal.params.normal.length_us = 55000 ;
		g_signal_callback_return_param.params.request.p_next = &g_timeslot_req_normal;
		uint8_t error_code = sd_radio_request(&g_timeslot_req_normal);
	
		
	}
	else
	{
		g_signal_callback_return_param.callback_action = NRF_RADIO_SIGNAL_CALLBACK_ACTION_END;
	}
}


//this timeslot request will be called when the requested timeslot is blocked by soft device and this function will request for new timeslot at the next connection interval set by the master in CONN_REQ packet
static __INLINE void next_timeslot_schedule_block(void)
{
	if (sm_adv_run)
	{ 
  
		
		a = (a + cointerval); // the next  timeslot will be called at next connection interval after the blocking of the last timeslot request
		
		g_timeslot_req_normal.params.normal.distance_us = a-1000 ;
		g_timeslot_req_normal.params.normal.length_us = 10000 ;
		g_signal_callback_return_param.params.request.p_next = &g_timeslot_req_normal;
		
		uint8_t error_code = sd_radio_request(&g_timeslot_req_normal);
		
		APP_ERROR_CHECK(error_code);
		
	}
	else
	{
		g_signal_callback_return_param.callback_action = NRF_RADIO_SIGNAL_CALLBACK_ACTION_END;
	}
}


void  new_timeslot_order(void)
{   nrf_gpio_pin_toggle(23);
	  switch (sm_state)
			{
				case STATE_SLAVE_TO_MASTER_TRANSMIT_2:
					
				    sm_adv_run = true;
				    sm_state = STATE_SLAVE_TO_MASTER_TRANSMIT_2;
				
				    last_unmapped_channel = unmapped_channel ;
				
				    if ((channel_map_instant - connection_event_counter )== 1 )	
															 {     
															 
																 memcpy( (void*) &chmapp, (void*) &new_chmapp[0], 40);
																 memcpy( (void*) &used_channel_map, (void*) &new_used_channel_map[0],40);
																 num_used_channel= new_num_used_channel;

															}	
															 
															
				    connection_event_counter++ ;
				    
				    
				if ((instant > 0)&&(connection_event_counter == instant) )
				     {
					      cointerval = new_cointerval ;
					      instant = 0 ; 
								sm_adv_run =1 ;
				     }
				
						      set_channel_connection();                  //find data_channel
								  next_timeslot_schedule_block(); 
	     
				    
     				break;
				
				case STATE_FIRST_ORDER_TIMESLOT:
				 
			    	 sm_state = STATE_FIRST_ORDER_TIMESLOT;
						 sm_adv_run = true;					
					   next_timeslot_schedule_advertisement(); 
				    
				    break;
				
				default:
					// Shouldn't happen 
			  
					ASSERT(false);
				  
				  break;	
			}
}



void ctrl_timeslot_order(void)
{
	sm_adv_run = true;
	timeslot_req_initial(); //sd_radio_request(&g_timeslot_req_earliest);
}


void ctrl_timeslot_order_first(void)
{
	sm_adv_run = true;
	sm_state = STATE_FIRST_ORDER_TIMESLOT;
	timeslot_req_initial(); //sd_radio_request(&g_timeslot_req_earliest);
}

void ctrl_timeslot_abort(void)
{
	sm_adv_run = false;
}

#endif


/**********************************************************************/

void find_channel_map(void);

 void get_connection_param(void)
{
	
	 memset(&AdvA,0, 6);
 memcpy((void*) AdvA, (void*) &ble_rx_buf[9], BLE_ADDR_LEN);
	

	 memset(&AcessA,0, 4);
 memcpy((void*) AcessA, (void*) &ble_rx_buf[15], 4);
	
		 memset(&CRCinit,0, 3);
 memcpy((void*) CRCinit, (void*) &ble_rx_buf[19], 3);
	

	
	memset(&WinOffset, 0, 2);
 memcpy((void*) WinOffset, (void*) &ble_rx_buf[23], 2);
  woffset = WinOffset[1]<<8;
  woffset =  woffset + WinOffset[0] ;
  woffset = ( woffset* 1250) ;


	memset(&ConnInterval,0, 2);
 memcpy((void*) ConnInterval, (void*) &ble_rx_buf[25], 2); 
 cointerval = ConnInterval[1]<<8;
 cointerval = cointerval + ConnInterval[0] ;
 cointerval = (cointerval * 1250)-300 ;
	
	//find_channel_map();
	
	uint8_t i,j,k;
	
	memset(&ChMapp,0, 5);
 memcpy( (void*) ChMapp, (void*) &ble_rx_buf[31], 5);
 
 //convert channel map bit to channel array chmapp[40]



	char an= 0x01;	
	char b;
	j=0;
	for (i=0;i<40;i++ )
		    { 
					
					chmapp[i]= ChMapp[j] & an ;
				  ChMapp[j]= ChMapp[j] >> 1;
					if ((i== 7)||(i==15)|| (i== 23)|| (i== 31)) j++ ;
				}
	
	
	
	//find number of used channels and prepare used channel map 
	j=0;
	num_used_channel = 0 ;
				
	for(i=0;i<40;i++)
	{
		 if(chmapp[i]== 1) 
		 {
			 num_used_channel = num_used_channel + 1;
		   used_channel_map[j]= i;
       j=j+1;			 
		 }
	}
	
 
  
