NordicPlayground/nRF51-multi-role-conn-observer-advertiser/btle_hci/advertiser/ts_controller.c
	memset(&Hop,0, 1);
 memcpy( (void*) Hop, (void*) &ble_rx_buf[36], 1);
   an= 0x1F;	
   b=0;
 b = Hop[0] & an  ;	
 hopping = b;
 
 

}





void set_channel_connection(void)
{
	uint8_t remapping_index;
  unmapped_channel = (last_unmapped_channel + hopping)% 37 ;
	//data_channel = unmapped_channel ;
	
	if(chmapp[unmapped_channel]== 1)
	     data_channel = unmapped_channel ;
	
	else
	{
	   remapping_index = unmapped_channel % num_used_channel;
		 data_channel= used_channel_map[remapping_index] ;
	}		
}	

 







static bool is_conn_req_for_me(void)
{	
	
	/* check PDU as CONN_REQ */
	if (0x05 != (ble_rx_buf[0] & 0x0F)) // check whether it is CONNECT_REQ PDU type
	{ 
		return false;
	}
	
	/* check included ADV addr, which must match own ADV addr */
	if (memcmp(	(void*) &ble_adv_data[BLE_ADDR_OFFSET], 
							(void*) &ble_rx_buf[BLE_PAYLOAD_OFFSET], BLE_ADDR_LEN) != 0)
	{
		return false;
	}
	
	/* all fields ok */
	++packet_count_valid;
	
	return true;
}




/**
* Extract the scanner address from the rx buffer
*/
static __INLINE void scan_addr_get(btle_address_type_t *addr_type, uint8_t* addr)
{
	*addr_type = ((ble_rx_buf[BLE_TYPE_OFFSET] & BLE_ADDR_TYPE_MASK) > 0 ? BTLE_ADDR_TYPE_RANDOM : BTLE_ADDR_TYPE_PUBLIC);
	
	memcpy((void*) addr, (void*) &ble_rx_buf[BLE_ADDR_OFFSET], BLE_ADDR_LEN);	
}

/**
* Get data from rx-buffer and dispatch scan req event
*/
static __INLINE void scan_req_evt_dispatch(void)
{
	/* prepare scan req report */
	nrf_report_t scan_req_report;
	
	/* packet counters */
	scan_req_report.valid_packets = packet_count_valid;
	scan_req_report.invalid_packets = packet_count_invalid;
	 
	/* event details */
	scan_req_report.event.event_code = BTLE_VS_EVENT_NRF_LL_EVENT_SCAN_REQ_REPORT;
	scan_req_report.event.opcode			= BTLE_CMD_NONE;
	
	scan_addr_get(&scan_req_report.event.params.nrf_scan_req_report_event.address_type, 
									scan_req_report.event.params.nrf_scan_req_report_event.address);
	
	periph_radio_rssi_read(&(scan_req_report.event.params.nrf_scan_req_report_event.rssi));
	periph_radio_channel_get(&(scan_req_report.event.params.nrf_scan_req_report_event.channel));
	
	/* send scan req event to user space */
	nrf_report_disp_dispatch(&scan_req_report);
}


/**
* Short check to verify that the incomming 
* message was a scan request for this unit
*/
static bool is_scan_req_for_me(void)
{	
	/* check CRC. Add to number of CRC faults if wrong */
	if (0 == NRF_RADIO->CRCSTATUS) 
	{
		++packet_count_invalid;
		return false;
	}
	
	/* check message type and length */
	
	if ((0x03 != (ble_rx_buf[0] & 0x0F)) || 
			(0x0C != ble_rx_buf[1])) //C=12=1100
	{
		return false;
	}
	/* check included ADV addr, which must match own ADV addr */
	if (memcmp(	(void*) &ble_adv_data[BLE_ADDR_OFFSET], 
							(void*) &ble_rx_buf[BLE_PAYLOAD_OFFSET], BLE_ADDR_LEN) != 0)
	{
		return false;
	}
	
	/* all fields ok */
	++packet_count_valid;
	
	return true;
}





static __INLINE void channel_iterate(void)
{
	channel_map = BTLE_CHANNEL_MAP_ALL ;
	while (((channel_map & (1 << (++channel - 37))) == 0) && channel < 40);	
}




static __INLINE void adv_evt_setup(void)
{
	periph_radio_setup();
	
	/* set channel to first in sequence */
	channel = 36; /* will be iterated by channel_iterate() */
	channel_iterate();

}	


static void sm_enter_adv_send(void)
{
	sm_state = STATE_ADV_SEND;
	

	periph_radio_ch_set(channel);

	
	/* trigger task early, the rest of the setup can be done in RXRU */

	PERIPHERAL_TASK_TRIGGER(NRF_RADIO->TASKS_TXEN);
	
	periph_radio_packet_ptr_set(&ble_adv_data[0]);
	
#if TS_SEND_SCAN_RSP
	periph_radio_shorts_set(	RADIO_SHORTS_READY_START_Msk | 
														RADIO_SHORTS_END_DISABLE_Msk |
														RADIO_SHORTS_DISABLED_RXEN_Msk);
#else
	periph_radio_shorts_set(	RADIO_SHORTS_READY_START_Msk | 
														RADIO_SHORTS_END_DISABLE_Msk);
#endif    
	
	periph_radio_intenset(RADIO_INTENSET_DISABLED_Msk);
//	periph_radio_tifs_set(148);
	
}




static void sm_exit_adv_send(void)
{
	/* wipe events and interrupts triggered by this state */
	periph_radio_intenclr(RADIO_INTENCLR_DISABLED_Msk);
	PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_DISABLED);
}






	
	
	
void sm_enter_master_to_slave_receive (void)
{
	
							sm_state = STATE_MASTER_TO_SLAVE_RECEIVE_2;
							set_channel_connection(); //find data_channel index

							NRF_RADIO->FREQUENCY = data_freq_bins[data_channel]; 
	            NRF_RADIO->DATAWHITEIV = 0;
	            NRF_RADIO->DATAWHITEIV = (uint32_t) data_channel;
	
							NRF_RADIO->TXADDRESS = 0x00;					// Use logical address 0 (prefix0 + base0)  when transmitting
							NRF_RADIO->RXADDRESSES = 0x01;        // Use logical address 0 (prefix0 + base0)  when receiving
	
							/* configure radio for master to slave data receive*/
							periph_radio_packet_ptr_set(&ble_rx_buf[0]);
	
							NRF_RADIO->EVENTS_DISABLED = 0;
							NRF_RADIO->EVENTS_ADDRESS = 0;
								
							PERIPHERAL_TASK_TRIGGER(NRF_RADIO->TASKS_RXEN);
							periph_radio_shorts_set(	RADIO_SHORTS_READY_START_Msk | 
																			RADIO_SHORTS_END_DISABLE_Msk |
																			RADIO_SHORTS_DISABLED_TXEN_Msk);
							periph_radio_intenset(	RADIO_INTENSET_DISABLED_Msk);
							
							periph_radio_intenset(	RADIO_INTENSET_ADDRESS_Msk);
							
							/* change the tifs in order to be able to capture all packets */
							periph_radio_tifs_set(148);
							
}

void enter_wait_for_idle(void)
{

               sm_state = STATE_WAIT_FOR_IDLE;
							
							 periph_timer_abort(0);
							 periph_ppi_clear(0);
							
							 NRF_TIMER0->TASKS_CLEAR = 1;
							
						//	periph_radio_intenclr(RADIO_INTENCLR_ADDRESS_Msk);
						//  PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_ADDRESS);
							
							periph_radio_intenclr(RADIO_INTENCLR_DISABLED_Msk);
	            PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_DISABLED);
							

							periph_radio_intenset(RADIO_INTENSET_DISABLED_Msk);
							periph_radio_shorts_set(0);

							
	            PERIPHERAL_TASK_TRIGGER(NRF_RADIO->TASKS_DISABLE);

}


void set_base_prefix_crc_with_new_perameter_from_conn_req (void)
{

              NRF_RADIO->CRCINIT = CRCinit[2];
	            NRF_RADIO->CRCINIT = (NRF_RADIO->CRCINIT)<<8;
	            NRF_RADIO->CRCINIT = (NRF_RADIO->CRCINIT) | CRCinit[1];
							NRF_RADIO->CRCINIT = (NRF_RADIO->CRCINIT)<<8;
							NRF_RADIO->CRCINIT = (NRF_RADIO->CRCINIT) | CRCinit[0];				
	
