NordicPlayground/nRF51-multi-role-conn-observer-advertiser/btle_hci/advertiser/ts_controller.c
							NRF_RADIO->PREFIX0	 = AcessA[3]; //0x8e;
	            NRF_RADIO->BASE0 = AcessA[2];
							NRF_RADIO->BASE0 = (NRF_RADIO->BASE0)<<8;
							NRF_RADIO->BASE0 = (NRF_RADIO->BASE0) | AcessA[1];
							NRF_RADIO->BASE0 = (NRF_RADIO->BASE0)<<8;
							NRF_RADIO->BASE0 = (NRF_RADIO->BASE0) | AcessA[0];
							NRF_RADIO->BASE0 = (NRF_RADIO->BASE0)<<8;
												
							NRF_RADIO->TXADDRESS = 0x00;					// Use logical address 0 (prefix0 + base0)  when transmitting
							NRF_RADIO->RXADDRESSES = 0x01;        // Use logical address 0 (prefix0 + base0)  when receiving


}




void get_new_connection_perameter (void)
	
{
                   memset(&new_ConnInterval,0, 2);
									 memcpy((void*) new_ConnInterval, (void*) &ble_rx_buf[7], 2); 
									 new_cointerval = new_ConnInterval[1]<<8;
									 new_cointerval = new_cointerval + new_ConnInterval[0] ;
									 new_cointerval = (new_cointerval * 1250)-300 ;
								 
								   memset(&new_WinOffset, 0, 2);
									 memcpy((void*) new_WinOffset, (void*) &ble_rx_buf[5], 2);
								
								   new_woffset = new_WinOffset[1]<<8;
									 new_woffset = new_woffset + new_WinOffset[0] ;
									 new_woffset = (new_woffset * 1250) ;
								 
								   memset(&Instant, 0, 2);
									 memcpy((void*) Instant, (void*) &ble_rx_buf[13], 2);
								   instant = Instant[1]<<8;
									 instant = instant + Instant[0] ;




}

void get_new_channel_map_perameter (void)
{										
								   memset(&Channel_Map_Instant, 0, 2);
									 memcpy((void*) Channel_Map_Instant, (void*) &ble_rx_buf[9], 2);
								   channel_map_instant = Channel_Map_Instant[1]<<8;
									 channel_map_instant = channel_map_instant + Channel_Map_Instant[0] ;
							 
								   memset(&New_ChMapp,0, 5);
								   memcpy( (void*) New_ChMapp, (void*) &ble_rx_buf[4], 5);


                  uint8_t i,j,k;
									char an= 0x01;	
								
									j=0;
									for (i=0;i<40;i++ )
												{ 
													
													new_chmapp[i]= New_ChMapp[j] & an ;
													New_ChMapp[j]= New_ChMapp[j] >> 1;
													if ((i== 7)||(i==15)|| (i== 23)|| (i== 31)) j++ ;
												}
									
									
									
									//find number of used channels and prepare used channel map 
									j=0;
									new_num_used_channel = 0 ;
												
									for(i=0;i<40;i++)
									{
										 if(new_chmapp[i]== 1) 
										 {
											 new_num_used_channel = new_num_used_channel + 1;
											 new_used_channel_map[j]= i;
											 j=j+1;			 
										 }
									}
}



#if nosoftdevice


void TIMER0_IRQHandler(void)
{
	switch (sm_state)
			{
				case STATE_WAIT_FOR_IDLE_1:
					 if (NRF_TIMER0->EVENTS_COMPARE[0] != 0)
						{  
							 periph_timer_abort(0);
							 NRF_TIMER0->TASKS_CLEAR = 1;
							
							instant = 0 ;
						  missed_counter = 0 ;
						  flag=0 ;
							
							adv_evt_setup();
							sm_enter_adv_send();
						
						}  
			     break;
						
				case STATE_REQ:
					 if (NRF_TIMER0->EVENTS_COMPARE[0] != 0)
						{  
	  
							enter_wait_for_idle();
							
						}  
			     break;

        case STATE_MASTER_TO_SLAVE_RECEIVE:
					 if (NRF_TIMER0->EVENTS_COMPARE[0] != 0) 
						{  
							
							set_base_prefix_crc_with_new_perameter_from_conn_req ();
							
							sm_enter_master_to_slave_receive();
						
						}  
			     break;	
						
				case STATE_SLAVE_TO_MASTER_TRANSMIT_2:
					 if (NRF_TIMER0->EVENTS_COMPARE[0] != 0)
						{  
							 sm_state = STATE_MASTER_TO_SLAVE_RECEIVE_3;
											
						   memset(&ble_rx_buf[0], 0, 15);  // clear the RAM to avoid interference from last data
					     NRF_TIMER0->POWER = 1;
							
							
							last_unmapped_channel = unmapped_channel ;
							
							if ((channel_map_instant - connection_event_counter )== 1 )	
														 {     
																 memcpy( (void*) &chmapp, (void*) &new_chmapp[0], 40);
																 memcpy( (void*) &used_channel_map, (void*) &new_used_channel_map[0],40);
																 num_used_channel= new_num_used_channel;
															}						
															 
							
							
							set_channel_connection(); //find data_channel
							
							reconfigure_radio_for_connection () ;
							start_master_to_slave_receive ();
							
							periph_timer_start(0, 10000, true);
						
							
							
							
			
						}  
			     break;	
						
					case STATE_MASTER_TO_SLAVE_RECEIVE_3:
									 if (NRF_TIMER0->EVENTS_COMPARE[0] != 0)
										{ 
											 sm_state = STATE_SLAVE_TO_MASTER_TRANSMIT_2;	
											
											 periph_timer_abort(0);
											 NRF_TIMER0->TASKS_CLEAR = 1;
											 x1=0;
											
											
											 missed_counter ++ ;
											
											if (missed_counter == 10 ) 
											{     
												    missed_counter = 0 ;
												
														periph_radio_intenclr(RADIO_INTENCLR_DISABLED_Msk);
														PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_DISABLED);
														NRF_RADIO->SHORTS = 0;
														
														last_unmapped_channel= 0;
														unmapped_channel= 0 ;
												    
                            adv_evt_setup();
						                sm_enter_adv_send();												
												
														
											}

											connection_event_counter ++ ;

											if ((instant > 0)&&(connection_event_counter == instant ))
											{										   
														   instant = 0 ; 
															 sm_adv_run =1 ;
												       cointerval = new_cointerval ;

											}
											
                        periph_timer_start(0, cointerval-10400, true);
											
						            
										}
								   break;	

						
         default:
					// Shouldn't happen 
					ASSERT(false);
				  break;						
			}
}

void next_advertisement (void)
{
	 periph_timer_start(0, adv_int_min*1000/*120000*/, true); // Advertisement interval in us
   NVIC_EnableIRQ(TIMER0_IRQn);
	
}


void RADIO_IRQHandler(void)

{
	// check state, and act accordingly 
			switch (sm_state)
			{
				case STATE_ADV_SEND:
						if (NRF_RADIO->EVENTS_DISABLED != 0)
						{
							
							
							periph_radio_intenclr(RADIO_INTENCLR_DISABLED_Msk);
							PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_DISABLED);
							
							periph_radio_intenclr(RADIO_INTENCLR_ADDRESS_Msk);
							PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_ADDRESS);
							
							memset(&ble_rx_buf[0], 0, 15);  
							
							periph_radio_intenset(RADIO_INTENSET_DISABLED_Msk);
							
							sm_enter_req();
						}
						break;
					
				case STATE_REQ:
					
						if(RADIO_EVENT(EVENTS_ADDRESS))  	
						 {

							periph_radio_intenclr(RADIO_INTENCLR_ADDRESS_Msk);
							PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_ADDRESS);
						 }
						
						 if (RADIO_EVENT(EVENTS_DISABLED))
							{
							periph_timer_abort(0);
							
