NordicPlayground/nRF51-multi-role-conn-observer-advertiser/btle_hci/advertiser/ts_controller.c
							periph_ppi_clear(0);
							
							periph_radio_intenclr(RADIO_INTENCLR_DISABLED_Msk);
							PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_DISABLED);
						
         
						
									if(is_conn_req_for_me())
									{  
										 sm_state = STATE_MASTER_TO_SLAVE_RECEIVE;
							
										 get_connection_param();
										
										 periph_timer_abort(0);
										 NRF_TIMER0->TASKS_CLEAR = 1;
										
										 periph_timer_start(0, 800+woffset, true);
										
										 NRF_RADIO->TASKS_DISABLE = 1; // to clear TX state from sm_enter_req() 
										 NRF_RADIO->SHORTS = 0;
										
					    	}
								else if (is_scan_req_for_me())
								{  
									
									periph_radio_intenclr(RADIO_INTENCLR_ADDRESS_Msk);
									PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_ADDRESS);
									
									periph_radio_intenclr(RADIO_INTENCLR_DISABLED_Msk);
									PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_DISABLED);
									
									sm_state = STATE_WAIT_FOR_IDLE;
									
								
									periph_radio_intenset(RADIO_INTENSET_DISABLED_Msk);
									periph_radio_packet_ptr_set(&ble_scan_rsp_data[0]);
									periph_radio_shorts_set(RADIO_SHORTS_READY_START_Msk | RADIO_SHORTS_END_DISABLE_Msk);
									
									periph_radio_tifs_set(150);
									

								
								}	
								else 
									
								{  

									sm_state = STATE_WAIT_FOR_IDLE;
	
									periph_radio_intenclr(RADIO_INTENCLR_ADDRESS_Msk);
									PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_ADDRESS);
									
									periph_radio_intenset(RADIO_INTENSET_DISABLED_Msk);
									periph_radio_shorts_set(0);
	
									
									PERIPHERAL_TASK_TRIGGER(NRF_RADIO->TASKS_DISABLE);
										
									
									
								}
					}
				
					break;
					
       case STATE_MASTER_TO_SLAVE_RECEIVE_3:
					
						if(RADIO_EVENT(EVENTS_ADDRESS))  	
							 {

								periph_radio_intenclr(RADIO_INTENCLR_ADDRESS_Msk);
								PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_ADDRESS);
								 
					  	 }
					
				  	if (RADIO_EVENT(EVENTS_DISABLED)) //
					    {    
						   

							periph_radio_intenclr(RADIO_INTENCLR_DISABLED_Msk);
	            PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_DISABLED);
						
								if (((ble_rx_buf[0] &(0x03)) == 0x03) && (ble_rx_buf[3]==0x02))  // check for termination end
								 {
	
											if(ble_rx_buf[0] == 0x03)
													 ble_terminate_data[0]=0x07;
											else if (ble_rx_buf[0] == 0x0F) 
													ble_terminate_data[0]=0x0B;
										
											ble_terminate_data[4]= ble_rx_buf[4]; 
											periph_radio_packet_ptr_set(&ble_terminate_data[0]);
											periph_radio_shorts_set(	RADIO_SHORTS_READY_START_Msk | 
																						RADIO_SHORTS_END_DISABLE_Msk );
																						//RADIO_SHORTS_DISABLED_TXEN_Msk);
											periph_radio_intenset(	RADIO_INTENSET_DISABLED_Msk);
											periph_radio_intenset(	RADIO_INTENSET_ADDRESS_Msk);///////address mask
											sm_state = STATE_SLAVE_TO_MASTER_TRANSMIT_END;				
										
							 }
							 
							 else if(((ble_rx_buf[0] &(0x03)) == 0x03) && (ble_rx_buf[3]==0x00)/*&& (ble_rx_buf[1]== 0x0C)*/)   // check for CONN_UPDATE_REQ
							 {
							 
								     get_new_connection_perameter () ;
								 
											 if(ble_rx_buf[0] == 0x03)
													 ble_linklayer_data[0]=0x05;
											else if (ble_rx_buf[0] == 0x0F) 
													ble_linklayer_data[0]=0x09;
											
											
	
											periph_radio_packet_ptr_set(&ble_linklayer_data[0]);
								
											periph_radio_shorts_set(	RADIO_SHORTS_READY_START_Msk | 
																						RADIO_SHORTS_END_DISABLE_Msk );
																						
											periph_radio_intenset(	RADIO_INTENSET_DISABLED_Msk);
										
										
										
											periph_radio_intenset(	RADIO_INTENSET_ADDRESS_Msk);
										
											sm_state = STATE_SLAVE_TO_MASTER_TRANSMIT_3;		
										
							 
							 }
							 
							 else if(((ble_rx_buf[0] &(0x03)) == 0x03) && (ble_rx_buf[3]==0x01)/*&& (ble_rx_buf[1]== 0x08)*/)   // check for CHANNEL_MAP_REQ
							 {   

								  
														
										if(ble_rx_buf[0] == 0x03)
													 ble_acknow_data[0]=0x05;
										else if (ble_rx_buf[0] == 0x0F) 
													ble_acknow_data[0]=0x09;

											periph_radio_packet_ptr_set(&ble_acknow_data[0]);
											get_new_channel_map_perameter ();
										
											periph_radio_shorts_set(	RADIO_SHORTS_READY_START_Msk | 
																						RADIO_SHORTS_END_DISABLE_Msk );
																						//RADIO_SHORTS_DISABLED_TXEN_Msk);
											periph_radio_intenset(	RADIO_INTENSET_DISABLED_Msk);
												
											periph_radio_intenset(	RADIO_INTENSET_ADDRESS_Msk);
										
											sm_state = STATE_SLAVE_TO_MASTER_TRANSMIT_3;		
										
								 
								 
							 }
							 
							 else if(((ble_rx_buf[0] &(0x03)) == 0x03) && (ble_rx_buf[3]==0x0C)/*&& (ble_rx_buf[1]== 0x08)*/)   // check for LL_VERSION_IND
							 { 
 								 
								 if((ble_rx_buf[0]& (0x0F)) == 0x03)
								    ble_version_data[0]=0x07;
						     else if ((ble_rx_buf[0] & (0x0F)) == 0x0F) 
								    ble_version_data[0]=0x0B;  
								 
								 
								    periph_radio_packet_ptr_set(&ble_version_data[0]);
											
										periph_radio_shorts_set(	RADIO_SHORTS_READY_START_Msk | 
																						RADIO_SHORTS_END_DISABLE_Msk );
																						//RADIO_SHORTS_DISABLED_TXEN_Msk);
										periph_radio_intenset(	RADIO_INTENSET_DISABLED_Msk);
										
										periph_radio_intenset(	RADIO_INTENSET_ADDRESS_Msk);///////address mask
										
										sm_state = STATE_SLAVE_TO_MASTER_TRANSMIT_3;	
								 
							 }
							 
							 else if(((ble_rx_buf[0] &(0x03)) == 0x03) && (ble_rx_buf[3]==0x08)/*&& (ble_rx_buf[1]== 0x08)*/)   // check for LL_FEATURE_REQ
							 { 

								 if((ble_rx_buf[0]& (0x0F)) == 0x03)
								    ble_feature_rsp_data[0]=0x07;
						     else if ((ble_rx_buf[0] & (0x0F)) == 0x0F) 
								    ble_feature_rsp_data[0]=0x0B;  
								 
								 
								    periph_radio_packet_ptr_set(&ble_feature_rsp_data[0]);
								
										periph_radio_shorts_set(	RADIO_SHORTS_READY_START_Msk | 
																						RADIO_SHORTS_END_DISABLE_Msk );
																						//RADIO_SHORTS_DISABLED_TXEN_Msk);
										periph_radio_intenset(	RADIO_INTENSET_DISABLED_Msk);

										periph_radio_intenset(	RADIO_INTENSET_ADDRESS_Msk);///////address mask
										
