NordicPlayground/nRF51-multi-role-conn-observer-advertiser/btle_hci/advertiser/ts_controller.c
										sm_state = STATE_SLAVE_TO_MASTER_TRANSMIT_3;	
								 
							 }
							 
						  else
							{

							 if((ble_rx_buf[0] & (0x0C)) == 0x00)
								ble_linklayer_data[0]=0x15;
						  else if ((ble_rx_buf[0] & (0x0C))== 0x0C) 
								ble_linklayer_data[0]=0x19;
							
						
							/* configure radio for master to slave data receive*/
							periph_radio_packet_ptr_set(&ble_linklayer_data[0]);
					
							periph_radio_shorts_set(	RADIO_SHORTS_READY_START_Msk | 
																			RADIO_SHORTS_END_DISABLE_Msk );
																			//RADIO_SHORTS_DISABLED_TXEN_Msk);
							periph_radio_intenset(	RADIO_INTENSET_DISABLED_Msk);
	
							periph_radio_intenset(	RADIO_INTENSET_ADDRESS_Msk);///////address mask
							
						  sm_state = STATE_SLAVE_TO_MASTER_TRANSMIT_3;
							
				
							}
							
					}
					break;					
					
				case	STATE_SLAVE_TO_MASTER_TRANSMIT_END:
						if (RADIO_EVENT(EVENTS_DISABLED))
					 {    
						  sm_state = STATE_START_FROM_INITIAL;
						 
           periph_radio_intenclr(RADIO_INTENCLR_ADDRESS_Msk);
						PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_ADDRESS);
						 
						periph_radio_intenclr(RADIO_INTENCLR_DISABLED_Msk);
	          PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_DISABLED);
						 
						 
								 
							periph_timer_abort(0);
		          NRF_TIMER0->TASKS_CLEAR = 1;
								 
							periph_radio_intenset(	RADIO_INTENSET_DISABLED_Msk);
							NRF_RADIO->TASKS_DISABLE = 1; // to clear TX state from sm_enter_req() 
	            NRF_RADIO->SHORTS = 0;
					
					}
					
					break;
					
       case STATE_SLAVE_TO_MASTER_TRANSMIT_3:
					{	
				
						if(RADIO_EVENT(EVENTS_ADDRESS))  	
						 {

							periph_radio_intenclr(RADIO_INTENCLR_ADDRESS_Msk);
							PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_ADDRESS);
						 }
					 
					 
							if (RADIO_EVENT(EVENTS_DISABLED))
							{    

								sm_state = STATE_SLAVE_TO_MASTER_TRANSMIT_2;		
								
								periph_radio_intenclr(RADIO_INTENCLR_DISABLED_Msk);
								PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_DISABLED);
								NRF_RADIO->SHORTS = 0;		

								NRF_TIMER0->TASKS_CAPTURE[1] = 1;
								x1 = NRF_TIMER0->CC[1] ;	
								NRF_TIMER0->TASKS_STOP = 1;		
								missed_counter = 0 ;
								
								connection_event_counter ++ ;
								
								if ((instant > 0)&&(connection_event_counter == instant ))
													{
																	 instant = 0 ; 
																	 sm_adv_run =1 ;
																	 cointerval = new_cointerval ;

													}
													
									periph_timer_start(0, (cointerval-300), true);
													
								 
							}
					
				}
					break;		
				
    	case STATE_MASTER_TO_SLAVE_RECEIVE_2:
					
						if(RADIO_EVENT(EVENTS_ADDRESS))  	
						 {
							 
							periph_radio_intenclr(RADIO_INTENCLR_ADDRESS_Msk);
							PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_ADDRESS);

						 }
						
						if (RADIO_EVENT(EVENTS_DISABLED)) //
						{    
								 
								 connection_event_counter= 0;
							
								 periph_timer_abort(0);
								 NRF_TIMER0->TASKS_CLEAR = 1;

								periph_radio_intenclr(RADIO_INTENCLR_DISABLED_Msk);
								PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_DISABLED);
							
								
								if((ble_rx_buf[0] & (0x0F))== 0x01) ble_linklayer_data[0]=0x05;
								else if ((ble_rx_buf[0] & (0x0F))== 0x0D) ble_linklayer_data[0]=0x09;
								
								/* configure radio for master to slave data receive*/
								 periph_radio_packet_ptr_set(&ble_linklayer_data[0]);
						
								periph_radio_shorts_set(	RADIO_SHORTS_READY_START_Msk | 
																				RADIO_SHORTS_END_DISABLE_Msk );
																				//RADIO_SHORTS_DISABLED_TXEN_Msk);
								periph_radio_intenset(	RADIO_INTENSET_DISABLED_Msk);

								periph_radio_intenset(	RADIO_INTENSET_ADDRESS_Msk);///////address mask
								
								sm_state = STATE_SLAVE_TO_MASTER_TRANSMIT;
								
						}
					break;
					
        case STATE_SLAVE_TO_MASTER_TRANSMIT:
						
					if(RADIO_EVENT(EVENTS_ADDRESS))  	
					 {

						periph_radio_intenclr(RADIO_INTENCLR_ADDRESS_Msk);
						PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_ADDRESS);
					 }
					 
					 
					if (RADIO_EVENT(EVENTS_DISABLED))
					{    
			
						sm_state = STATE_SLAVE_TO_MASTER_TRANSMIT_2;
						
						periph_radio_intenclr(RADIO_INTENCLR_DISABLED_Msk);
	          PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_DISABLED);
						NRF_RADIO->SHORTS = 0;		

						periph_timer_start(0, (cointerval-100) , true);      //anchor point 
            						
					}
					break;

					
				case STATE_WAIT_FOR_IDLE:
					if (RADIO_EVENT(EVENTS_DISABLED))
					{
						// state exit function returns whether the adv event is complete 
						
						bool adv_evt_done = sm_exit_wait_for_idle();
						
						if (adv_evt_done)
						{ 
							sm_state= STATE_WAIT_FOR_IDLE_1;
							next_advertisement();
						}
						else
						{
							sm_enter_adv_send();
						}
					}
					break;		

       case STATE_START_FROM_INITIAL:
				 
					if (RADIO_EVENT(EVENTS_DISABLED))
					{ 
						
						periph_radio_intenclr(RADIO_INTENCLR_DISABLED_Msk);
	          PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_DISABLED);
						NRF_RADIO->SHORTS = 0;
						
						last_unmapped_channel= 0;
						unmapped_channel= 0 ;
						
						instant = 0 ;
						missed_counter = 0 ;
						flag=0 ;
						
						adv_evt_setup();
						sm_enter_adv_send();
						
					}
					break;								

					
			
				default:
					// Shouldn't happen 
					ASSERT(false);
				  break;
			}	
}

#endif
/***********************************************************************************/

 void sm_enter_req(void)
{
	sm_state = STATE_REQ;

	
	periph_radio_packet_ptr_set(&ble_rx_buf[0]);
	
	 
	
	periph_radio_shorts_set(	RADIO_SHORTS_READY_START_Msk | 
														RADIO_SHORTS_END_DISABLE_Msk |
	                          RADIO_SHORTS_DISABLED_TXEN_Msk );
	
	periph_radio_intenset(	RADIO_INTENSET_DISABLED_Msk);

	/* change the tifs in order to be able to capture all packets */
	periph_radio_tifs_set(148);
	
	/* start the timer that aborts the RX if no address is received. */
	periph_timer_start(0, 200, true);
	
	/* set PPI pipe to stop the timer as soon as an address is received */
	periph_ppi_set(0, &(NRF_TIMER0->TASKS_STOP), &(NRF_RADIO->EVENTS_ADDRESS));
	
