NordicPlayground/nRF51-multi-role-conn-observer-advertiser/btle_hci/advertiser/ts_controller.c
}



/*****************************************
* Functions for start/end of WAIT_FOR_IDLE
******************************************/


static bool sm_exit_wait_for_idle(void)
{
	periph_radio_intenclr(RADIO_INTENCLR_DISABLED_Msk);
	PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_DISABLED);
	
	channel_iterate();
	return (channel > 39);
}


#if nosoftdevice
void radio_2(void)
{
			adv_evt_setup();
}


void adv_2 ()
{ 		
			sm_enter_adv_send();
}


#endif





void ctrl_init(void)
{
	/* set the contents of advertisement and scan response to something
	that is in line with BLE spec */
	
	/* erase package buffers */
	memset(&ble_adv_data[0], 0, 40);  
#if TS_SEND_SCAN_RSP	
	memset(&ble_scan_rsp_data[0], 0, 40);
#endif 
	
#if TS_SEND_SCAN_RSP	
	/* set message type to ADV_IND_DISC, RANDOM in type byte of adv data */
	ble_adv_data[BLE_TYPE_OFFSET] = 0x46;
	/* set message type to SCAN_RSP, RANDOM in type byte of scan rsp data */
	ble_scan_rsp_data[BLE_TYPE_OFFSET] = 0x44;
#else
	/* set message type to ADV_IND_NONCONN, RANDOM in type byte of adv data */
	ble_adv_data[BLE_TYPE_OFFSET] = 0x42;
#endif
	

	ble_adv_data[BLE_ADFLAG_OFFSET]  = 0x00;
  ble_adv_data[BLE_ADFLAG_OFFSET] |= (1 << 1);  /* General discoverable mode */
  ble_adv_data[BLE_ADFLAG_OFFSET] |= (1 << 2);    /* BR/EDR not supported      */

	/* set message length to only address */
	ble_adv_data[BLE_SIZE_OFFSET] 			= 0x06;
#if TS_SEND_SCAN_RSP
	ble_scan_rsp_data[BLE_SIZE_OFFSET] 	= 0x06;
#endif	
	
	/* generate rng sequence */
	#if softdevice
	    //adv_rng_init(rng_pool); ///  ?+??
	#endif
}





/***************************************************************************/


void reconfigure_radio_for_connection (void)
{
                      NRF_RADIO->POWER = 1;
	
											NRF_RADIO->EVENTS_DISABLED = 0;
											NRF_RADIO->EVENTS_READY = 0;
											
											/* Timer: 1us resolution, disable peripheral */
											 
											NRF_TIMER0->PRESCALER = 4;
											
											NRF_TIMER0->TASKS_STOP = 1;
	
						          NRF_RADIO->TXPOWER = (RADIO_TXPOWER_TXPOWER_0dBm << RADIO_TXPOWER_TXPOWER_Pos);
                      NRF_RADIO->MODE 	 = (RADIO_MODE_MODE_Ble_1Mbit << RADIO_MODE_MODE_Pos);

											NRF_RADIO->PREFIX0	 = AcessA[3]; //0x8e;
											NRF_RADIO->BASE0 = AcessA[2];
											NRF_RADIO->BASE0 = (NRF_RADIO->BASE0)<<8;
											NRF_RADIO->BASE0 = (NRF_RADIO->BASE0) | AcessA[1];
											NRF_RADIO->BASE0 = (NRF_RADIO->BASE0)<<8;
											NRF_RADIO->BASE0 = (NRF_RADIO->BASE0) | AcessA[0];
											NRF_RADIO->BASE0 = (NRF_RADIO->BASE0)<<8;
						
							NRF_RADIO->FREQUENCY = data_freq_bins[data_channel]; 
	            NRF_RADIO->DATAWHITEIV = 0;
	            NRF_RADIO->DATAWHITEIV = (uint32_t) data_channel;
							

							NRF_RADIO->TXADDRESS = 0x00;					// Use logical address 0 (prefix0 + base0)  when transmitting
							NRF_RADIO->RXADDRESSES = 0x01;        // Use logical address 0 (prefix0 + base0)  when receiving
							
							/* PCNF-> Packet Configuration. Now we need to configure the sizes S0, S1 and length field to match the datapacket format of the advertisement packets. */
   NRF_RADIO->PCNF0 =  (
                          (((1UL) << RADIO_PCNF0_S0LEN_Pos) & RADIO_PCNF0_S0LEN_Msk)    // length of S0 field in bytes 0-1. // 8UL and 1UL 
                        | (((2UL) << RADIO_PCNF0_S1LEN_Pos) & RADIO_PCNF0_S1LEN_Msk)    // length of S1 field in bits 0-8. // 16UL and FUL
                        | (((6UL) << RADIO_PCNF0_LFLEN_Pos) & RADIO_PCNF0_LFLEN_Msk)    // length of length field in bits 0-8. // 0UL and FUL
                      );
 
	/* Packet configuration */
  NRF_RADIO->PCNF1 =  (
                          (((37UL)                      << RADIO_PCNF1_MAXLEN_Pos)  & RADIO_PCNF1_MAXLEN_Msk)   // maximum length of payload in bytes [0-255]
                        | (((0UL)                       << RADIO_PCNF1_STATLEN_Pos) & RADIO_PCNF1_STATLEN_Msk)	// expand the payload with N bytes in addition to LENGTH [0-255]
                        | (((3UL)                       << RADIO_PCNF1_BALEN_Pos)   & RADIO_PCNF1_BALEN_Msk)    // base address length in number of bytes.
                        | (((RADIO_PCNF1_ENDIAN_Little) << RADIO_PCNF1_ENDIAN_Pos)  & RADIO_PCNF1_ENDIAN_Msk)   // endianess of the S0, LENGTH, S1 and PAYLOAD fields.
                        | (((1UL)                       << RADIO_PCNF1_WHITEEN_Pos) & RADIO_PCNF1_WHITEEN_Msk)	// enable packet whitening
                      );
	NRF_RADIO->CRCCNF  = (RADIO_CRCCNF_LEN_Three << RADIO_CRCCNF_LEN_Pos) | 
                       (RADIO_CRCCNF_SKIPADDR_Skip << RADIO_CRCCNF_SKIPADDR_Pos); // Skip Address when computing crc
											 
											 
	                    NRF_RADIO->CRCINIT = CRCinit[2];
											NRF_RADIO->CRCINIT = (NRF_RADIO->CRCINIT)<<8;
											NRF_RADIO->CRCINIT = (NRF_RADIO->CRCINIT) | CRCinit[1];
											NRF_RADIO->CRCINIT = (NRF_RADIO->CRCINIT)<<8;
											NRF_RADIO->CRCINIT = (NRF_RADIO->CRCINIT) | CRCinit[0];			
											
											NRF_RADIO->CRCPOLY = 0x00065B;    // CRC polynomial function
											
											NVIC_EnableIRQ(RADIO_IRQn);



}

void start_master_to_slave_receive (void)
{
/* configure radio for master to slave data receive*/
							periph_radio_packet_ptr_set(&ble_rx_buf[0]);
							NRF_RADIO->EVENTS_DISABLED = 0;
							
							NRF_RADIO->EVENTS_ADDRESS = 0;
								
							PERIPHERAL_TASK_TRIGGER(NRF_RADIO->TASKS_RXEN);
							periph_radio_shorts_set(	RADIO_SHORTS_READY_START_Msk | 
																			RADIO_SHORTS_END_DISABLE_Msk |
																			RADIO_SHORTS_DISABLED_TXEN_Msk);
							periph_radio_intenset(	RADIO_INTENSET_DISABLED_Msk);
							
							periph_radio_intenset(	RADIO_INTENSET_ADDRESS_Msk);
							
							/* change the tifs in order to be able to capture all packets */
							periph_radio_tifs_set(153);

}

#if softdevice
__INLINE void ctrl_signal_handler(uint8_t sig)
{ 
	switch (sig)
	{
		case NRF_RADIO_CALLBACK_SIGNAL_TYPE_START:	/// timeslot start 
		{
					
			
				switch (sm_state)
					{
						case STATE_FIRST_ORDER_TIMESLOT:
							        
						
									  
