NordicPlayground/nRF51-multi-role-conn-observer-advertiser/btle_hci/advertiser/ts_controller.c
						          NRF_TIMER0->POWER = 1;
						
										  adv_evt_setup();
									  	sm_enter_adv_send();
						          
						          instant = 0 ;
						          missed_counter = 0 ;
						          flag=0 ;
						
			        		break;
						
						case STATE_SLAVE_TO_MASTER_TRANSMIT_2:
									  
							        sm_state = STATE_MASTER_TO_SLAVE_RECEIVE_3;
											
						          memset(&ble_rx_buf[0], 0, 15);  // clear the RAM to avoid interference from last data
						
						            NRF_TIMER0->POWER = 1;
						
						               last_unmapped_channel = unmapped_channel ; // update last_unmapped_channel
						
														if ((channel_map_instant - connection_event_counter )== 1 )	
															 {     									
																 memcpy( (void*) &chmapp, (void*) &new_chmapp[0], 40);
																 memcpy( (void*) &used_channel_map, (void*) &new_used_channel_map[0],40);
																 num_used_channel= new_num_used_channel;

															}						
						
											set_channel_connection(); //find data_channel
															
//											}
												
						          reconfigure_radio_for_connection () ;
						
											start_master_to_slave_receive ();

							        // start TIMER0 to calculate the distance from timeslot start to slave to master reception and store the time in x1 to use it for next timeslot order 
						          // this x1 value is used to compensate the time drift
						          periph_timer_start(0, 8000, true);
										 
    									x1=0;
						
                  
						
			            break;
						
						default:
					// Shouldn't happen 
					ASSERT(false);
				  break;
					}
		}
			break;

		
		case NRF_RADIO_CALLBACK_SIGNAL_TYPE_RADIO: /**************************************************************/
		{
		
			/* check state, and act accordingly */
			switch (sm_state)
			{
				case STATE_ADV_SEND:
					if (RADIO_EVENT(EVENTS_DISABLED))
					{
	
					  periph_radio_intenclr(RADIO_INTENCLR_DISABLED_Msk); // always clear interrupt at the start of new state 
	          PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_DISABLED);   // always clear event at the start of new state 
						
						periph_radio_intenclr(RADIO_INTENCLR_ADDRESS_Msk);
						PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_ADDRESS);
						
						memset(&ble_rx_buf[0], 0, 15);  // clear the RAM to avoid interference from last data 
						
						periph_radio_intenset(RADIO_INTENSET_DISABLED_Msk);

						sm_enter_req();
						
					
						
					}
					break;
					
			 case STATE_REQ:
					if(RADIO_EVENT(EVENTS_ADDRESS))  	
					 {
						 
						periph_radio_intenclr(RADIO_INTENCLR_ADDRESS_Msk); // always clear interrupt at the start of new state 
						PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_ADDRESS);   // always clear event at the start of new state 
						 
					 }
					
				 if (RADIO_EVENT(EVENTS_DISABLED))
				 	{
						periph_timer_abort(0);   // clear TIMER0 after receiving either SCAN_RSP or CONN_REQ  
						periph_ppi_clear(0);     // clear PPI after receiving either SCAN_RSP or CONN_REQ  
						
						periph_radio_intenclr(RADIO_INTENCLR_DISABLED_Msk); // always clear interrupt at the start of new state 
          	PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_DISABLED);   // always clear event at the start of new state 

						  nrf_gpio_pin_toggle(21);
						
						if(is_conn_req_for_me())
						 {  
							 
							 a=0;
							 
							 nrf_gpio_pin_toggle(22);
							 sm_state = STATE_MASTER_TO_SLAVE_RECEIVE; // NEXT state
              
							 get_connection_param(); // get connection parameter from CONN_REQ PDU from master 
							
						   periph_timer_abort(0);
		           
               NRF_TIMER0->INTENSET = (1 << (TIMER_INTENSET_COMPARE2_Pos));
							 NVIC_EnableIRQ(TIMER0_IRQn);
               NRF_TIMER0->PRESCALER = 4;
               NRF_TIMER0->BITMODE=TIMER_BITMODE_BITMODE_32Bit;
											
							 NRF_TIMER0->TASKS_CLEAR = 1;
							 NRF_TIMER0->EVENTS_COMPARE[2] = 0; 
							 NRF_TIMER0->CC[2] = 800+woffset; /* timeout for RX abort */
							 NRF_TIMER0->TASKS_START = 1;
												
							 NRF_RADIO->TASKS_DISABLE = 1; // to clear TX state from sm_enter_req() 
	             NRF_RADIO->SHORTS = 0;
					 
						}
						
						else if (is_scan_req_for_me())
						{ 
              
							 sm_state = STATE_WAIT_FOR_IDLE; // NEXT state 
							
						   periph_radio_intenclr(RADIO_INTENCLR_ADDRESS_Msk); // always clear interrupt at the start of new state
						   PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_ADDRESS);  // always clear event at the start of new state 
							 
							 periph_radio_intenclr(RADIO_INTENCLR_DISABLED_Msk); // always clear interrupt at the start of new state
	             PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_DISABLED);  // always clear event at the start of new state 

	            /* enable disabled interrupt to avoid race conditions */
	             periph_radio_intenset(RADIO_INTENSET_DISABLED_Msk);
							
							 periph_radio_packet_ptr_set(&ble_scan_rsp_data[0]);  // prepare to send SCAN_RSP 
		      		 periph_radio_shorts_set(RADIO_SHORTS_READY_START_Msk | RADIO_SHORTS_END_DISABLE_Msk);
							
		         	/* wait exactly 150us to send response. NOTE: the Reference manual is wrong */
							 periph_radio_tifs_set(150);
							
						}	
						
						else 
							
						{  

							sm_state = STATE_WAIT_FOR_IDLE;  // NEXT state 
							/* enable disabled interrupt to avoid race conditions */
							
							periph_radio_intenclr(RADIO_INTENCLR_ADDRESS_Msk); // always clear interrupt at the start of new state
						  PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_ADDRESS);   // always clear event at the start of new state 
							
							periph_radio_intenset(RADIO_INTENSET_DISABLED_Msk);
							periph_radio_shorts_set(0);

	            PERIPHERAL_TASK_TRIGGER(NRF_RADIO->TASKS_DISABLE);	
							
						}
					}
				
					break;

					case STATE_MASTER_TO_SLAVE_RECEIVE_3:
					
					 if(RADIO_EVENT(EVENTS_ADDRESS))  	
					 {

						periph_radio_intenclr(RADIO_INTENCLR_ADDRESS_Msk);
						PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_ADDRESS);
						 
