NordicPlayground/nRF51-multi-role-conn-observer-advertiser/btle_hci/advertiser/ts_controller.c
            NRF_TIMER0->TASKS_CAPTURE[1] = 1;
						x1 = NRF_TIMER0->CC[1] ;	
						NRF_TIMER0->TASKS_STOP = 1;		
						missed_counter = 0 ;
						
						connection_event_counter ++ ;
						
						 
						if ((instant > 0)&&(connection_event_counter == instant ))
											{
														   instant = 0 ; 
															 sm_adv_run =1 ;
												       cointerval = new_cointerval ;

											}

						  next_timeslot_schedule_connection_2();
					}
					
				}
					break;
					 
					case STATE_MASTER_TO_SLAVE_RECEIVE_2:
					
					if(RADIO_EVENT(EVENTS_ADDRESS))  	
					 {

						periph_radio_intenclr(RADIO_INTENCLR_ADDRESS_Msk);
						PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_ADDRESS);
						 
					 }
					
					if (RADIO_EVENT(EVENTS_DISABLED)) 
					{    
						   connection_event_counter= 0 ;
						
						   periph_timer_abort(0);
						
						   NRF_TIMER0->INTENCLR = (1 << (TIMER_INTENCLR_COMPARE1_Pos ));
						
							 NRF_TIMER0->TASKS_CLEAR = 1;
						
							
							periph_radio_intenclr(RADIO_INTENCLR_DISABLED_Msk);
	            PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_DISABLED);
						
							
						  
						  if((ble_rx_buf[0] & (0x0F))== 0x01) ble_linklayer_data[0]=0x05;
						  else if ((ble_rx_buf[0] & (0x0F))== 0x0D) ble_linklayer_data[0]=0x09;
						
							/* configure radio for master to slave data receive*/
							 periph_radio_packet_ptr_set(&ble_linklayer_data[0]);
					
							periph_radio_shorts_set(	RADIO_SHORTS_READY_START_Msk | 
																			RADIO_SHORTS_END_DISABLE_Msk );
																			//RADIO_SHORTS_DISABLED_TXEN_Msk);
							periph_radio_intenset(	RADIO_INTENSET_DISABLED_Msk);

							periph_radio_intenset(	RADIO_INTENSET_ADDRESS_Msk);
							
						  sm_state = STATE_SLAVE_TO_MASTER_TRANSMIT;
							
					}
					break;
					
				case STATE_SLAVE_TO_MASTER_TRANSMIT:
						
					if(RADIO_EVENT(EVENTS_ADDRESS))  	
					 {
					
						 
						periph_radio_intenclr(RADIO_INTENCLR_ADDRESS_Msk);
						PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_ADDRESS);
					 }
					 
					 
					if (RADIO_EVENT(EVENTS_DISABLED))
					{    

						sm_state = STATE_SLAVE_TO_MASTER_TRANSMIT_2;		
						
						periph_radio_intenclr(RADIO_INTENCLR_DISABLED_Msk);
	          PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_DISABLED);
						NRF_RADIO->SHORTS = 0;		

						next_timeslot_schedule_connection();
						
            				
					}
					break;
					
				case STATE_WAIT_FOR_IDLE:
					if (RADIO_EVENT(EVENTS_DISABLED))
					{
						
						/* state exit function returns whether the adv event is complete */
						bool adv_evt_done = sm_exit_wait_for_idle();
						
						if (adv_evt_done)
						{ 
							nrf_gpio_pin_toggle(20);
							sm_state= STATE_FIRST_ORDER_TIMESLOT;
							next_timeslot_schedule();
						}
						else
						{ 
							sm_enter_adv_send();
						}
					}
					break;	

        case STATE_START_FROM_INITIAL:
				 
					if (RADIO_EVENT(EVENTS_DISABLED))
					{ 
						
						periph_radio_intenclr(RADIO_INTENCLR_DISABLED_Msk);
	          PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_DISABLED);
						NRF_RADIO->SHORTS = 0;
						
						last_unmapped_channel= 0;
						unmapped_channel= 0 ;
						
						sm_state= STATE_FIRST_ORDER_TIMESLOT;
						next_timeslot_schedule();
						

						
					}
					break;					
			
				default:
					/* Shouldn't happen */
					ASSERT(false);
				}
		}
			break;
		
		
		case NRF_RADIO_CALLBACK_SIGNAL_TYPE_TIMER0:/**************************************************************/
		{  
				 switch (sm_state)
							{
								case STATE_REQ: 
									
										if (NRF_TIMER0->EVENTS_COMPARE[0] != 0)
													{  
														
														nrf_gpio_pin_toggle(24);
														periph_timer_abort(0);
														NRF_TIMER0->TASKS_CLEAR = 1;
														periph_ppi_clear(0);
														
														periph_radio_intenclr(RADIO_INTENCLR_ADDRESS_Msk);
														PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_ADDRESS);
														
														periph_radio_intenclr(RADIO_INTENCLR_DISABLED_Msk);
														PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_DISABLED);
														
														sm_state = STATE_WAIT_FOR_IDLE;
														/* enable disabled interrupt to avoid race conditions */
														
														periph_radio_intenset(RADIO_INTENSET_DISABLED_Msk);
														periph_radio_shorts_set(0);						
														
														PERIPHERAL_TASK_TRIGGER(NRF_RADIO->TASKS_DISABLE);
													
													}  
								break;
								
						  case STATE_MASTER_TO_SLAVE_RECEIVE:
									 if (NRF_TIMER0->EVENTS_COMPARE[2] != 0)
										{  

											//set_base_prefix_crc_with_new_perameter_from_conn_req ();
											
											NRF_RADIO->CRCINIT = CRCinit[2];
											NRF_RADIO->CRCINIT = (NRF_RADIO->CRCINIT)<<8;
											NRF_RADIO->CRCINIT = (NRF_RADIO->CRCINIT) | CRCinit[1];
											NRF_RADIO->CRCINIT = (NRF_RADIO->CRCINIT)<<8;
											NRF_RADIO->CRCINIT = (NRF_RADIO->CRCINIT) | CRCinit[0];				
					
											NRF_RADIO->PREFIX0	 = AcessA[3]; //0x8e;
											NRF_RADIO->BASE0 = AcessA[2];
											NRF_RADIO->BASE0 = (NRF_RADIO->BASE0)<<8;
											NRF_RADIO->BASE0 = (NRF_RADIO->BASE0) | AcessA[1];
											NRF_RADIO->BASE0 = (NRF_RADIO->BASE0)<<8;
											NRF_RADIO->BASE0 = (NRF_RADIO->BASE0) | AcessA[0];
											NRF_RADIO->BASE0 = (NRF_RADIO->BASE0)<<8;
																
											NRF_RADIO->TXADDRESS = 0x00;					// Use logical address 0 (prefix0 + base0)  when transmitting
											NRF_RADIO->RXADDRESSES = 0x01;        // Use logical address 0 (prefix0 + base0)  when receiving
											
											sm_enter_master_to_slave_receive();
										
										}  
									 break;	
								
               case STATE_MASTER_TO_SLAVE_RECEIVE_3:
									 if (NRF_TIMER0->EVENTS_COMPARE[0] != 0)
										{ 
											 sm_state = STATE_SLAVE_TO_MASTER_TRANSMIT_2;	
											
											 periph_timer_abort(0);
											 NRF_TIMER0->TASKS_CLEAR = 1;
											 x1=0;

											 missed_counter ++ ;
											
											if (missed_counter == 10 ) 
											{     
												    missed_counter = 0 ;
												
														periph_radio_intenclr(RADIO_INTENCLR_DISABLED_Msk);
														PERIPHERAL_EVENT_CLR(NRF_RADIO->EVENTS_DISABLED);
														NRF_RADIO->SHORTS = 0;
														
														last_unmapped_channel= 0;
														unmapped_channel= 0 ;
														
														sm_state= STATE_FIRST_ORDER_TIMESLOT;
														next_timeslot_schedule();
											}

											 connection_event_counter ++ ;


											if ((instant > 0)&&(connection_event_counter == instant ))
											{
														   instant = 0 ; 
															 sm_adv_run =1 ;
												       cointerval = new_cointerval ;
		
											
