NordicPlayground/nRF51-multi-role-conn-observer-advertiser/btle_hci/advertiser/ts_controller.c
											}
											
						                next_timeslot_schedule_connection_timer();/****************************************************************/
										}
								   break;
										
								default:
							// Shouldn't happen /*/**/
				
							ASSERT(false);
							break;
							}
		}
					break;
		
		


		default:
			DEBUG_PIN_POKE(14);
			/* shouldn't happen in this advertiser. */	
      break;		
	}
	
}	




#endif

/***************************************************************************/


bool ctrl_adv_param_set(btle_cmd_param_le_write_advertising_parameters_t* adv_params)
{
	ASSERT(adv_params != NULL);
	/* Checks for error */

	/* channel map */
	if (0x00 == adv_params->channel_map || 0x07 < adv_params->channel_map)
	{
		return false;
	}

	/* address */
	if (NULL == adv_params->direct_address)
	{
		return false;
	}

	/* set channel map */
	channel_map = adv_params->channel_map;


	/* put address into advertisement packet buffer */
	static uint8_t ble_addr[] = {0x4e, 0x6f, 0x72, 0x64, 0x69, 0x63};   //DEFAULT_DEVICE_ADDRESS;
	memcpy((void*) &ble_adv_data[BLE_ADDR_OFFSET],
				 (void*) &ble_addr[0], BLE_ADDR_LEN);

#if TS_SEND_SCAN_RSP
	/* put address into scan response packet buffer */
	memcpy((void*) &ble_scan_rsp_data[BLE_ADDR_OFFSET], 
					(void*) &adv_params->direct_address[0], BLE_ADDR_LEN);
#endif
	
	/* address type */
	ble_adv_data[BLE_TYPE_OFFSET] &= BLE_ADDR_TYPE_MASK; //0x40  scan response data type 0100 
	ble_adv_data[BLE_TYPE_OFFSET] |= (adv_params->own_address_type) << 6;
#if TS_SEND_SCAN_RSP
	ble_scan_rsp_data[BLE_TYPE_OFFSET] &= BLE_ADDR_TYPE_MASK;
	ble_scan_rsp_data[BLE_TYPE_OFFSET] |= (adv_params->own_address_type) << 6;
#endif
	
	/* whitelist */
	if (BTLE_ADV_FILTER_ALLOW_ANY 		== adv_params->filter_policy || 
			BTLE_ADV_FILTER_ALLOW_LEVEL2 	== adv_params->filter_policy)
	{
		wl_disable();
	}
	else
	{
		wl_enable();
	}

	/* Advertisement interval */
	adv_int_min = adv_params->interval_min;
	adv_int_max = adv_params->interval_max;

#if TS_SEND_SCAN_RSP	
	/* adv type */
	ble_adv_data[BLE_TYPE_OFFSET] &= ~BLE_TYPE_MASK; //0x3F     ADV_SCAN_IND
	ble_adv_data[BLE_TYPE_OFFSET] |= (ble_adv_type_raw[adv_params->type] & BLE_TYPE_MASK);  //0000 0110

	/* scan rsp type */
	ble_scan_rsp_data[BLE_TYPE_OFFSET] &= ~BLE_TYPE_MASK;  //SCAN _RSP
	ble_scan_rsp_data[BLE_TYPE_OFFSET] |= 0x04;
#else
	/* adv type is locked to nonconn */
	ble_adv_data[BLE_TYPE_OFFSET] &= ~BLE_TYPE_MASK;
	ble_adv_data[BLE_TYPE_OFFSET] |= (ble_adv_type_raw[BTLE_ADV_TYPE_NONCONN_IND] & BLE_TYPE_MASK); //ADV_NONCONN_IND
#endif
	return true;
}



bool ctrl_adv_data_set(btle_cmd_param_le_write_advertising_data_t* adv_data)
{	
	ASSERT(adv_data != NULL);
	
	/* length cannot exceed 31 bytes */
	uint8_t len = ((adv_data->data_length <= BLE_PAYLOAD_MAXLEN)? 
									adv_data->data_length : 
									BLE_PAYLOAD_MAXLEN);

	/* put into packet buffer */
	memcpy((void*) &ble_adv_data[BLE_PAYLOAD_OFFSET], //9
					(void*) &adv_data->advertising_data[0], len);

	/* set length of packet in length byte. Account for 6 address bytes */
	ble_adv_data[BLE_SIZE_OFFSET] &= 0x00;
	ble_adv_data[BLE_SIZE_OFFSET] = (BLE_ADDR_LEN + len);

	return true;
}

bool ctrl_scan_data_set(btle_cmd_param_le_write_scan_response_data_t* data)
{
#if TS_SEND_SCAN_RSP	
	ASSERT(data != NULL);

	/* length cannot exceed 31 bytes */
	uint8_t len = ((data->data_length <= BLE_PAYLOAD_MAXLEN)? 
									data->data_length : 
									BLE_PAYLOAD_MAXLEN);

	/* put into packet buffer */
	memcpy((void*) &ble_scan_rsp_data[BLE_PAYLOAD_OFFSET], //9
					(void*) &data->response_data[0], len);

	/* set length of packet in length byte. Account for 3 header bytes
	* and 6 address bytes */
	ble_scan_rsp_data[BLE_SIZE_OFFSET] = (BLE_ADDR_LEN + len); //6 + ?
#endif	

	return true;
}
